In [1]:
from sqlalchemy import create_engine
import pandas as pd
from config import password

In [2]:
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/Employee_Research')
connection = engine.connect()

In [6]:
salary_df = pd.read_sql('select * from salaries', connection)
salary_df

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]

In [5]:
employees_df = pd.read_sql('select * from employees', connection)
employees_df

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18
...,...,...,...,...,...,...,...
300019,464231,s0001,1958-08-14,Constantino,Eastman,M,1988-10-28
300020,255832,e0002,1955-05-08,Yuping,Dayang,F,1995-02-26
300021,76671,s0001,1959-06-09,Ortrud,Plessier,M,1988-02-24
300022,264920,s0001,1959-09-22,Percy,Samarati,F,1994-09-08
300023,464503,s0002,1964-05-31,Arvind,Slobodova,M,1987-11-23

In [8]:
salary_employee = pd.merge(salary_df, employees_df, on='emp_no')
salary_employee

,emp_no,salary,emp_title_id,birth_date,first_name,last_name,sex,hire_date
0,10001,60117,e0003,1953-09-02,Georgi,Facello,M,1986-06-26
1,10002,65828,s0001,1964-06-02,Bezalel,Simmel,F,1985-11-21
2,10003,40006,e0003,1959-12-03,Parto,Bamford,M,1986-08-28
3,10004,40054,e0003,1954-05-01,Chirstian,Koblick,M,1986-12-01
4,10005,78228,s0001,1955-01-21,Kyoichi,Maliniak,M,1989-09-12
...,...,...,...,...,...,...,...,...
300019,499995,40000,e0002,1958-09-24,Dekang,Lichtner,F,1993-01-12
300020,499996,58058,e0003,1953-03-07,Zito,Baaz,M,1990-09-27
300021,499997,49597,e0003,1961-08-03,Berhard,Lenart,M,1986-04-21
300022,499998,40000,s0001,1956-09-05,Patricia,Breugel,M,1993-10-13
300023,499999,63707,e0002,1958-05-01,Sachin,Tsukuda,M,1997-11-30

In [12]:
new_df = salary_employee.rename(columns={"emp_title_id": "title_id"})
new_df

,emp_no,salary,title_id,birth_date,first_name,last_name,sex,hire_date
0,10001,60117,e0003,1953-09-02,Georgi,Facello,M,1986-06-26
1,10002,65828,s0001,1964-06-02,Bezalel,Simmel,F,1985-11-21
2,10003,40006,e0003,1959-12-03,Parto,Bamford,M,1986-08-28
3,10004,40054,e0003,1954-05-01,Chirstian,Koblick,M,1986-12-01
4,10005,78228,s0001,1955-01-21,Kyoichi,Maliniak,M,1989-09-12
...,...,...,...,...,...,...,...,...
300019,499995,40000,e0002,1958-09-24,Dekang,Lichtner,F,1993-01-12
300020,499996,58058,e0003,1953-03-07,Zito,Baaz,M,1990-09-27
300021,499997,49597,e0003,1961-08-03,Berhard,Lenart,M,1986-04-21
300022,499998,40000,s0001,1956-09-05,Patricia,Breugel,M,1993-10-13
300023,499999,63707,e0002,1958-05-01,Sachin,Tsukuda,M,1997-11-30

In [7]:
title_df = pd.read_sql('select * from titles', connection)
title_df

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager

In [21]:
merged_df = pd.merge(new_df, title_df, on='title_id')
merged_df

,emp_no,salary,title_id,birth_date,first_name,last_name,sex,hire_date,title
0,10001,60117,e0003,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer
1,10003,40006,e0003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer
2,10004,40054,e0003,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer
3,10006,40000,e0003,1953-04-20,Anneke,Preusig,F,1989-06-02,Senior Engineer
4,10009,60929,e0003,1952-04-19,Sumant,Peac,F,1985-02-18,Senior Engineer
...,...,...,...,...,...,...,...,...,...
300019,111534,48077,m0001,1952-06-27,Hilary,Kambil,F,1988-01-31,Manager
300020,111692,40000,m0001,1954-10-05,Tonny,Butterworth,F,1985-01-01,Manager
300021,111784,40000,m0001,1956-06-14,Marjo,Giarratana,F,1988-02-12,Manager
300022,111877,53846,m0001,1962-10-18,Xiaobin,Spinelli,F,1991-08-17,Manager
300023,111939,40000,m0001,1960-03-25,Yuchang,Weedman,M,1989-07-10,Manager

In [22]:
average_salary = merged_df.groupby('title').mean()
average_salary

                           emp_no        salary
title
Assistant Engineer  252992.595373  48564.434447
Engineer            253654.345919  48535.336511
Manager             110780.833333  51531.041667
Senior Engineer     253038.749885  48506.799871
Senior Staff        254481.798969  58550.172704
Staff               253408.503604  58465.382850
Technique Leader    251811.432730  48582.896092